#!/bin/bash

# მრავალჯერადი პირობა ერთ დებულებაში

a=15
b=17
c=13
echo -e "მნიშვნელობები:\na = 15\nb = 17\nc = 13\n"

# || ან/რომელიმე
# && და/ორივე

if [[ $a > $b ]] || [[ $a > $c ]]; then
	echo a მეტია b_ზე ან a მეტია c_ზე
fi

if [[ $a > $b ]] && [[ $b > $c ]]; then
	echo a მეტია b_ზე და b მეტია c_ზე
else
	echo a ვერ არის მეტი b_ზე ან b ვერ არის მეტი c_ზე
fi

if [[ $a < $b ]] && [[ $a > $c ]] || [[ $a > $b ]]; then
	echo a ნაკლებია b_ზე და a ნაკლებია c_ზე ან a მეტია b_ზე
else
	echo a ვერ არის ნაკლები b_ზე და a ვერ არის ნაკლები c_ზე ან/არც a ვერ არის მეტი b_ზე
fi
