#!/bin/bash

for (( i = 0; i <= 10; i++ )); do # "for" ციკლი ჰგავს "while"_ს ოღონდ განსხვავდება ცვლადის პირობაშივე მინიჭების/განსაზღრვის შესაძლებლობით, რაც ბევრად კომფორტულს ხდის მის გამოყენებას
	echo $i
done

# ან
# for i in {0..10}; do
#	echo $i
# done

echo # \n

# ორმაგი "for" ციკლის მაგალითი
for (( i = 0; i < 10; i++ )); do # პირველი ციკლი "i" ცვლადით
	for (( j=0; j < 10; j++ )); do # მეორე ციკლი "j" ცვლადით
		echo -n "$j$i " # "-n" რათა უარი თქვას ახალი ხაზის გამოყენებაზე
	done # მეორე ციკლის სასრული
		echo # ახალი ხაზისთვის როცა მეორე ციკლი დასრულდება
done # პირველი ციკლის სასრული
