#!/bin/bash

# მასივი გამოიყენება როგორც ინფორმაციის საცავისთვის ისე ვარიაციული მნიშვნელობისთვის
# მაგალითად myVar1=5; myVar2=8 ვარიაცული დანომრვის ნაცვლად გამოიყენოთ მასივი: myVar[0]=5; myVar[1]=8

array=(a b c d) # მასივი იქმნება მარტივად "( )" შორის განთავსებით. გამოყოფა ერთი მეორისგან ხდება ცარიელი სივრცით
# ასევე შესაძლია დაიწეროს: array=("a" "b" "c" "d")

array[5]=e # მასივში დამატება ხდება მარტივად რიგის ნომრის მიწერით
array[6]="ჩემი ტექსტი" # დამატების დროს თუ შუაში სივრცეა ეს ჩვეულებრიც გამოიწვევს ნომერაციის არევას, ამისთვის გამოიყენება " "
array[7]="მასივის სასრული"

echo მასივში არსებული ელემენტებია: ${array[@]} # "@" ნიშნავს საწყისიდან სასრულამდე სივრცეს
echo მასივში სულ არის: ${#array[@]} ერთეული # "#" ნიშნავს ერთეულთა რაოდენობას.
echo მათგან პირველია: ${array[0]} # "Array"_ში თვლა იწყება ნულიდან
echo მათგან მესამეა: ${array[2]}
echo მათგან მეექვსეა: ${array[5]}
echo მათგან მეშვიდეა: ${array[6]}
echo მათგან საბოლოოა: ${array[-1]}

echo მეორე ელემენტიდან აჩვენოს სხვა ელემენტებიც რაოდენობით ოთხი: ${array[@]:1:4}
echo მესამე ელემენტზე აჩვენოს მისგან სხვა ელემენტი რაოდენობით სამი: ${array[*]:2:3} # ":2:2" მნიშვნელობა ნიშნავს რიგით მესამეს შემდეგ გამოიტანოს ჯამში ორი ელემენტი
# "@" საწყისიდან სასრულამდე სივრცის ალტერნატივად შეიძლება გამოიყენოთ ყველა/სხვა დანარჩენი "*"
# ასევე შესაძლოა დაიწეროს: echo ${array[@]:2:3}

echo

declare -A animals # გააკეთოს განაცხადი რომ იქმნება მნიშვნელობითი არჩევანი "animals"_ისთვის
# დამატებითი ინფორმაცია: declare --help
animals=( ["მუუ"]="ძროხა" ["ვაფ"]="ძაღლი") # ვარიაციაში მნიშვნელობით არჩევა
animals["მიაუ"]="კატა" # დამატება ხდება იგივე მეთოდით რაც რიცხვითი მნიშვნელობის დროს
echo მუუ_ს იძახის: ${animals[მუუ]}
echo მიაუ_ს იძახის: ${animals[მიაუ]}
