#!/bin/bash

function main { # ფუნქცია სახელად "main"_ის გახსნა, როცა ის გააქტიურდება აღსრულდეს მასში არსებული პირობა
	echo პირველი ელემენტი: $1 # "$" _ის შემდეგ მნიშვნელი მიუთითებს ელემენტის რიგით ნომერზე (ფუნქციისთვის)
	echo მეორე ელემენტი: $2
	echo მესამე ელემენტი: $3

	echo ყველა ელემენტი: $*
} # ფუნქციის სასრული

function example { # ფუნქცია დემონსტრაციისთვის სადაც არ არის საჭიროება მიენიჭოს მნიშვნელობა პირობას
	for (( i = 0; i <= 5; i++ )); do
		echo $i
	done
}

function example2 { # ფუნქცია დემონსტრაციისთვის სადაც არის საჭიროება მიენიჭოს მნიშვნელობა პირობას
	for (( i = 0; i <= $1; i++ )); do
		echo $i
	done
}

main პირველი შემდეგი ბოლო # ფუნქციის სახელის შემდგომ იწერება ელემენტები
# ელემენტებს გადასცემს ფუნქციას და დაელოდება პასუხს რადგან როცა ფუნქციის სახელი იწერება ნიშნავს მის გააქტიურებას
echo # \n
main ვაშლი მსხალი ფორთოხალი
echo
example
echo
example2 3 # მიენიჭოს ფუნქცია "example2"_ს პირველ მნიშვნელობად სამი
