#!/bin/bash

# ბრძანების ცვლადის გატოლება ხდება: $(ბრძანება)

# პირდაპირი ფორმა
echo -e "\n\n\t####################################\n\t# პროგრამა \"ifconfig\"_ის დაბეჭდვა: #\n\t####################################\n\n"
echo -ne "$(ifconfig)" # "-ne" - ხაზგამთიში და escape ჩართვისთვის. "ეს კი სივრცის დაცვისთვის"

var=$(ls) # გაუტოლდეს ბრძანება(ხელსაწყოს) "ls" ცვლადის "var"
echo -e "\n\n\n\t##############################\n\t# პროგრამა \"ls\"_ის დაბეჭდვა: #\n\t##############################\n\n"
echo -ne "$var" # დაიბეჭდოს მინიჭებული ცვლადი

echo # \n
