#!/bin/bash

# exit ნიშნავს კოდის დასრულებას
# exit 0 კოდის წარმატებით დასრულდეს
# exit 1 კოდი შეცდომით დასრულდეს

if [[ $1 == "0" ]]; then
	exit 0 # რათა კოდის წარმატებით დასრულდეს
elif [[ $1 == "1" ]]; then
	exit 1 # რათა კოდი შეცდომით დასრულდეს
else

# && თუ შედეგი წარმატებით დასრულდა
# || თუ შედეგი წარუმატებლად დასრულდა (ჩაიშალა)
# ; თუ შედეგი დასრულდა

echo "გამოყენების ინსტრუქცია (შეიყვანეთ ტერმინალში სრული ბრძანება:"
echo -e "P.S. თუ დაიბეჭდა \"აღსრულდა\" ეს ნიშანია პროცესის გაგრძელების\n"

echo -e "\t&& და exit 0 ისთვის:\t./20.exit.sh 0 && echo აღსრულდა" # გაგრძელდება
echo -e "\t&& და exit 1 ისთვის:\t./20.exit.sh 1 && echo აღსრულდა" # ჩაიშლება
echo -e "\t|| და exit 0 ისთვის:\t./20.exit.sh 0 || echo აღსრულდა" # ჩაიშლება
echo -e "\t|| და exit 1 ისთვის:\t./20.exit.sh 1 || echo აღსრულდა" # გაგრძელდება
echo -e "\t; და exit 0 ისთვის:\t./20.exit.sh 0 ; echo აღსრულდა" # გაგრძელდება
echo -e "\t; და exit 1 ისთვის:\t./20.exit.sh 1 ; echo აღსრულდა" # გაგრძელდება
fi
