#!/bin/bash
i=8

# ცვლადის მნიშვნელობის გამოძახება შეიძლება სხვადასხვაგვარად
echo i = $i # ერთხაზობრივი შინაარის შემთხვევაში

echo "i = $i" # ერთშინაარობრივი გამოძახება

# ხაზობრივი მოქმედებების დროს საჭიროა წინამორბედი ფუნქციის დახურვა ";"
# -n ნიშნავს 
echo -n "i = "; echo  $i # "-n" ახალი ხაზის ფუნქციის გასათიშად

# მრავალხაზიანი გამოძახება ერთშინაარსობლივად
echo -n "i = "
echo -n $i
echo -en "\n" # "-e" ნიშნავს სპეციალური თეგების აქტივაციას. "\n" ერთ-ერთი თეგი რომელიც აღნიშნავს ხაზის წყვეტას ( "-n" - New line - ახალი ხაზი)

# ფორმატული ბეჭდვითი გამოძახება
printf "i = $i\n"
